# 1. Variables: Numerical or Categorical

**Numerical**: Continuous or Discrete

**Categorical**: Ordinal or Nominal

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = sns.load_dataset('tips')
print(df.dtypes)
df.head()

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:
df.select_dtypes(exclude=['number']).head()

      sex smoker  day    time
0  Female     No  Sun  Dinner
1    Male     No  Sun  Dinner
2    Male     No  Sun  Dinner
3    Male     No  Sun  Dinner
4  Female     No  Sun  Dinner

In [4]:
df.select_dtypes(include=['number']).head()

   total_bill   tip  size
0       16.99  1.01     2
1       10.34  1.66     3
2       21.01  3.50     3
3       23.68  3.31     2
4       24.59  3.61     4

In [5]:
df.select_dtypes(include=[float]).head()

   total_bill   tip
0       16.99  1.01
1       10.34  1.66
2       21.01  3.50
3       23.68  3.31
4       24.59  3.61

In [6]:
df.select_dtypes(include=[int]).head()

   size
0     2
1     3
2     3
3     2
4     4

In [7]:
var_num = df.select_dtypes(include=['number']).columns.to_list()
var_num_continuous = df.select_dtypes(include=[float]).columns.to_list()
var_num_discrete = df.select_dtypes(include=[int]).columns.to_list()
var_cat = df.select_dtypes(exclude=[np.number]).columns.to_list()
var_date = df.select_dtypes(include=['datetime']).columns.to_list()

var_num, var_cat, var_num_continuous, var_num_discrete, var_date

(['total_bill', 'tip', 'size'],
 ['sex', 'smoker', 'day', 'time'],
 ['total_bill', 'tip'],
 ['size'],
 [])

In [8]:
len(df.columns), len(df.select_dtypes(include=['number']).columns), len(df.select_dtypes(exclude=['number']).columns)

(7, 3, 4)